ok @Cylock, I used your sample `resource okta_idp_oidc bindid` on my test org and it works for me:

```terraform
terraform {
  required_providers {
    okta = {
      source = "okta/okta"
    }
  }
}

# export OKTA_API_TOKEN=XXXX
# export OKTA_ORG_NAME=XXXX
# export OKTA_BASE_URL=okta.com
# export TF_VAR_client_id=XXXX
# export TF_VAR_client_secret=XXXX

# terraform init
# terraform plan
# terraform apply

variable "client_id" {
    type = string
}

variable "client_secret" {
    type = string
}

resource okta_idp_oidc bindid {
    name                  = "BindId"
    authorization_url     = "https://signin.bindid-sandbox.io/authorize"
    authorization_binding = "HTTP-REDIRECT"
    token_url             = "https://signin.bindid-sandbox.io/token"
    token_binding         = "HTTP-POST"
    user_info_url         = "https://signin.bindid-sandbox.io/userinfo"
    user_info_binding     = "HTTP-REDIRECT"
    jwks_url              = "https://signin.bindid-sandbox.io/jwks"
    jwks_binding          = "HTTP-REDIRECT"
    scopes                = ["openid","email"]
    client_id             = var.client_id
    client_secret         = var.client_secret
    issuer_url            = "https://signin.bindid-sandbox.io"
    username_template     = "idpuser.email"
}
```

```shell
export OKTA_API_TOKEN=XXXX
export OKTA_ORG_NAME=XXXX
export OKTA_BASE_URL=okta.com
export TF_VAR_client_id=XXXX
export TF_VAR_client_secret=XXXX

 ○ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_idp_oidc.bindid will be created
  + resource "okta_idp_oidc" "bindid" {
      + account_link_action          = "AUTO"
      + authorization_binding        = "HTTP-REDIRECT"
      + authorization_url            = "https://signin.bindid-sandbox.io/authorize"
      + client_id                    = "0oaayrsmmgRlDp1d2696"
      + client_secret                = (sensitive value)
      + deprovisioned_action         = "NONE"
      + groups_action                = "NONE"
      + id                           = (known after apply)
      + issuer_mode                  = "ORG_URL"
      + issuer_url                   = "https://signin.bindid-sandbox.io"
      + jwks_binding                 = "HTTP-REDIRECT"
      + jwks_url                     = "https://signin.bindid-sandbox.io/jwks"
      + name                         = "BindId"
      + protocol_type                = "OIDC"
      + provisioning_action          = "AUTO"
      + request_signature_algorithm  = "SHA-256"
      + response_signature_algorithm = "SHA-256"
      + scopes                       = [
          + "email",
          + "openid",
        ]
      + status                       = "ACTIVE"
      + subject_match_type           = "USERNAME"
      + suspended_action             = "NONE"
      + token_binding                = "HTTP-POST"
      + token_url                    = "https://signin.bindid-sandbox.io/token"
      + type                         = (known after apply)
      + user_info_binding            = "HTTP-REDIRECT"
      + user_info_url                = "https://signin.bindid-sandbox.io/userinfo"
      + user_type_id                 = (known after apply)
      + username_template            = "idpuser.email"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

okta_idp_oidc.bindid: Creating...
okta_idp_oidc.bindid: Creation complete after 2s [id=0oahp2dpuKIjTYhka696]
```